/*public class MultiFor {
    public static void main(String[] args) {
        for (int x = 3; x > 1; x--) {    //этакий эффект матрицы, пока не будет выполнено нижнее условие, верхнее не менется свое значение<я это знал но тупой забыл
            //пока не пересчитаются игрики иксы не меняют значение, а на каждый новый икс - значения игриков пересчитываются по новой
            for (int y = 2; y < 4; y++) {
                System.out.println(x + " " + y);
            }
            }
        }
    }

 */


